аналитика со ссылками, обноаление readme
